In [1]:
import sqlite3
import pandas as pd
# ^^^ pyforest auto-imports - don't write above this line
import math

# Initier la connexion avec SQLITE3

In [2]:
connexion = sqlite3.connect('factbook.db')

In [3]:
cursor = connexion.cursor()

In [4]:
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")

In [5]:
print(cursor.fetchall())

[('facts',), ('sqlite_sequence',), ('landmarks',)]

# Charger les donner dans un dataframe Pandas

In [6]:
df = pd.read_sql_query('SELECT * FROM facts', connexion)

In [7]:
def pop_growth(df):
    return df.population * math.e ** ((df.population_growth/100)*35)

In [8]:
df['pop2050']= pop_growth(df)

In [9]:
df = df.dropna(axis=0)

In [10]:
df.sort_values(by=['pop2050'], ascending=False).head(10)

,id,code,name,area,area_land,area_water,population,population_growth,birth_rate,death_rate,migration_rate,created_at,updated_at,pop2050
76,77,in,India,3287263.0,2973193.0,314070.0,1.251696e+09,1.22,19.55,7.32,0.04,2015-11-01 13:26:24.788193,2015-11-01 13:26:24.788193,1.918415e+09
36,37,ch,China,9596960.0,9326410.0,270550.0,1.367485e+09,0.45,12.49,7.53,0.44,2015-11-01 13:22:53.813142,2015-11-01 13:22:53.813142,1.600752e+09
128,129,ni,Nigeria,923768.0,910768.0,13000.0,1.815621e+08,2.45,37.64,12.90,0.22,2015-11-01 13:30:39.695455,2015-11-01 13:30:39.695455,4.279890e+08
185,186,us,United States,9826675.0,9161966.0,664709.0,3.213689e+08,0.78,12.49,8.15,3.86,2015-11-01 13:35:14.898271,2015-11-01 13:35:14.898271,4.222466e+08
77,78,id,Indonesia,1904569.0,1811569.0,93000.0,2.559937e+08,0.92,16.72,6.37,1.16,2015-11-01 13:26:30.435758,2015-11-01 13:26:30.435758,3.532418e+08
131,132,pk,Pakistan,796095.0,770875.0,25220.0,1.990858e+08,1.46,22.58,6.49,1.54,2015-11-01 13:30:54.514863,2015-11-01 13:30:54.514863,3.318676e+08
13,14,bg,Bangladesh,148460.0,130170.0,18290.0,1.689577e+08,1.60,21.14,5.61,0.46,2015-11-01 13:20:52.753843,2015-11-01 13:20:52.753843,2.957897e+08
23,24,br,Brazil,8515770.0,8358140.0,157630.0,2.042598e+08,0.77,14.46,6.58,0.14,2015-11-01 13:21:42.799461,2015-11-01 13:21:42.799461,2.674393e+08
39,40,cg,"Congo, Democratic Republic of the",2344858.0,2267048.0,77810.0,7.937514e+07,2.45,34.88,10.07,0.27,2015-11-01 13:23:09.778305,2015-11-01 13:23:09.778305,1.871078e+08
113,114,mx,Mexico,1964375.0,1943945.0,20430.0,1.217368e+08,1.18,18.78,5.26,1.68,2015-11-01 13:29:28.845230,2015-11-01 13:29:28.845230,1.839863e+08

# Calcul du ratio aire terrestre /maritime avec SUM

In [11]:
data = pd.read_sql_query('SELECT SUM(area_land), SUM(area_water) FROM facts WHERE area_land !=""', connexion)

In [12]:
data

   SUM(area_land)  SUM(area_water)
0       128584834          4529125

In [13]:
data['SUM(area_land)']/data['SUM(area_water)']

0    28.390657
dtype: float64

# MIN(),  MAX(), AVG(), DISTINCT()

In [14]:
cursor.execute("SELECT MIN(population_growth) FROM facts;").fetchall()[0][0]

0.0

In [15]:
cursor.execute("SELECT MAX(death_rate) FROM facts;").fetchall()[0][0]

14.89

In [16]:
cursor.execute("SELECT SUM(area_land) FROM facts").fetchall()[0][0]

128584834

In [17]:
cursor.execute("SELECT AVG(area_water) FROM facts").fetchall()[0][0]

19067.59259259259

In [18]:
cursor.execute("SELECT AVG(population), SUM(population), MAX(birth_rate) FROM facts").fetchall()

[(62094928.32231405, 15026972654, 45.45)]

In [19]:
avg, summ, maxx = cursor.execute("SELECT AVG(population), SUM(population), MAX(birth_rate) FROM facts").fetchall()[0]

In [20]:
print(f"{avg:,.2f}")

62,094,928.32

In [21]:
cursor.execute("SELECT DISTINCT(birth_rate) FROM facts").fetchall()

[(38.57,),
 (12.92,),
 (23.67,),
 (8.13,),
 (38.78,),
 (15.85,),
 (16.64,),
 (13.61,),
 (12.15,),
 (9.41,),
 (15.5,),
 (13.66,),
 (21.14,),
 (11.87,),
 (10.7,),
 (11.41,),
 (24.68,),
 (36.02,),
 (17.78,),
 (22.76,),
 (8.87,),
 (20.96,),
 (14.46,),
 (17.32,),
 (8.92,),
 (42.03,),
 (18.39,),
 (42.01,),
 (23.83,),
 (36.17,),
 (10.28,),
 (20.33,),
 (35.08,),
 (36.6,),
 (13.83,),
 (12.49,),
 (16.47,),
 (27.84,),
 (34.88,),
 (35.85,),
 (15.91,),
 (28.67,),
 (9.45,),
 (9.9,),
 (9.63,),
 (10.27,),
 (23.65,),
 (15.41,),
 (18.73,),
 (18.51,),
 (22.9,),
 (16.46,),
 (33.31,),
 (30.0,),
 (10.51,),
 (37.27,),
 (19.43,),
 (10.72,),
 (12.38,),
 (34.49,),
 (30.86,),
 (12.74,),
 (8.47,),
 (31.09,),
 (8.66,),
 (16.03,),
 (24.89,),
 (35.74,),
 (33.38,),
 (15.59,),
 (22.31,),
 (23.14,),
 (9.16,),
 (13.91,),
 (19.55,),
 (16.72,),
 (17.99,),
 (31.45,),
 (14.84,),
 (18.48,),
 (8.74,),
 (18.16,),
 (7.93,),
 (25.37,),
 (19.15,),
 (26.4,),
 (21.46,),
 (14.52,),
 (8.19,),
 (None,),
 (19.91,),
 (22.98,),
 (24.25,),
 (10.0,),
 (14.59,),
 (25.47,),
 (34.41,),
 (18.03,),
 (10.45,),
 (10.1,),
 (11.37,),
 (11.55,),
 (32.61,),
 (41.56,),
 (19.71,),
 (15.75,),
 (44.99,),
 (10.18,),
 (25.6,),
 (31.34,),
 (13.29,),
 (18.78,),
 (20.54,),
 (12.0,),
 (6.65,),
 (20.25,),
 (10.42,),
 (18.2,),
 (38.58,),
 (19.8,),
 (24.95,),
 (20.64,),
 (10.83,),
 (13.33,),
 (45.45,),
 (37.64,),
 (12.14,),
 (24.44,),
 (22.58,),
 (11.05,),
 (18.32,),
 (24.38,),
 (16.37,),
 (18.28,),
 (24.27,),
 (9.74,),
 (9.27,),
 (9.84,),
 (9.14,),
 (11.6,),
 (33.75,),
 (13.5,),
 (13.7,),
 (13.57,),
 (20.87,),
 (8.63,),
 (34.23,),
 (34.52,),
 (9.08,),
 (14.19,),
 (37.03,),
 (8.27,),
 (9.91,),
 (8.42,),
 (25.77,),
 (40.45,),
 (20.75,),
 (36.91,),
 (9.64,),
 (29.19,),
 (16.34,),
 (24.67,),
 (11.99,),
 (10.5,),
 (22.17,),
 (36.39,),
 (11.19,),
 (34.16,),
 (34.13,),
 (23.0,),
 (13.46,),
 (16.33,),
 (19.4,),
 (23.74,),
 (43.79,),
 (15.43,),
 (12.17,),
 (13.07,),
 (17.0,),
 (25.04,),
 (19.16,),
 (15.96,),
 (29.98,),
 (42.13,),
 (32.26,),
 (10.2,),
 (9.23,),
 (8.88,),
 (13.77,),
 (14.48,),
 (15.22,),
 (15.33,),
 (7.42,),
 (13.45,),
 (12.56,),
 (13.8,),
 (13.0,),
 (14.33,),
 (12.67,),
 (11.33,),
 (10.91,),
 (12.11,),
 (10.9,),
 (14.08,),
 (11.91,),
 (11.1,),
 (11.26,),
 (9.88,),
 (16.13,),
 (22.89,),
 (16.82,),
 (10.86,),
 (10.31,),
 (31.11,),
 (22.99,),
 (30.24,),
 (18.6,)]

In [22]:
f'{cursor.execute("SELECT SUM(DISTINCT(population)) FROM facts WHERE area_land >1000000").fetchall()[0][0]:,.0f}'

'4,233,873,015'

# Groupement  GROUP BY - filtre avec HAVING sur une nouvelle colonne

In [23]:
connexion2 = sqlite3.connect('jobs.db')

In [24]:
cursor2 = connexion2.cursor()

In [25]:
cursor2.execute(
'SELECT Major_category, ROUND(AVG(low_wage_jobs)/AVG(Total),2) AS share_low_wages \
FROM recent_grads GROUP BY Major_category \
HAVING share_low_wages > 0.1;').fetchall()

[('Arts', 0.17),
 ('Communications & Journalism', 0.13),
 ('Humanities & Liberal Arts', 0.13),
 ('Industrial Arts & Consumer Services', 0.12),
 ('Law & Public Policy', 0.12),
 ('Psychology & Social Work', 0.12)]

# INNER JOIN

In [26]:
cursor.execute('SELECT * FROM landmarks INNER JOIN facts ON landmarks.country == facts.id').fetchall()

[(1,
  'Statue of Liberty',
  186,
  186,
  'us',
  'United States',
  9826675,
  9161966,
  664709,
  321368864,
  0.78,
  12.49,
  8.15,
  3.86,
  '2015-11-01 13:35:14.898271',
  '2015-11-01 13:35:14.898271'),
 (2,
  'Golden Gate Bridge',
  186,
  186,
  'us',
  'United States',
  9826675,
  9161966,
  664709,
  321368864,
  0.78,
  12.49,
  8.15,
  3.86,
  '2015-11-01 13:35:14.898271',
  '2015-11-01 13:35:14.898271'),
 (3,
  'Washington Monument',
  186,
  186,
  'us',
  'United States',
  9826675,
  9161966,
  664709,
  321368864,
  0.78,
  12.49,
  8.15,
  3.86,
  '2015-11-01 13:35:14.898271',
  '2015-11-01 13:35:14.898271')]

In [27]:
connexion.close()

In [28]:
connexion2.close()

# Requête sur base de données normalisées

In [29]:
!ls

academy_awards.csv  factbook3.db  jobs.db	  SQL.ipynb
academy_awards.db   factbook.db   nominations.db

In [30]:
connexion = sqlite3.connect('academy_awards.db')
cursor = connexion.cursor()

In [31]:
cursor.execute('PRAGMA table_info(nominations)').fetchall()

[(0, 'id', 'integer', 0, None, 1),
 (1, 'ceremony_id', 'integer', 0, None, 0),
 (2, 'category', 'text', 0, None, 0),
 (3, 'nominee', 'text', 0, None, 0),
 (4, 'movie', 'text', 0, None, 0),
 (5, 'character', 'text', 0, None, 0),
 (6, 'won', 'boolean', 0, None, 0)]

In [32]:
cursor.execute(
'SELECT nominations.movie \
FROM nominations \
INNER JOIN ceremonies ON nominations.ceremony_id == ceremonies.id \
WHERE ceremonies.year = 2010 AND nominations.won = 1').fetchall()

[("The King's Speech",), ('The Fighter',), ('Black Swan',), ('The Fighter',)]

In [33]:
cursor.execute(
'SELECT nominations.movie, ceremonies.year \
FROM nominations \
INNER JOIN ceremonies ON nominations.ceremony_id == ceremonies.id \
WHERE nominations.nominee = "Natalie Portman"').fetchall()

[('Black Swan', 2010), ('Closer', 2004)]

# Table intermédiaire

L'idée est de réunir les ids des 2 tables qui ont une relation N to N

In [34]:
cursor.execute(
'CREATE TABLE nn_movie_actors( \
id integer PRIMARY KEY, \
movie_id integer REFERENCES movies(id), \
actor_id integer REFERENCES actors(id))')

In [35]:
cursor.execute('DROP TABLE nn_movie_actors')

# Requête many to many

Exemple de requête many to many

In [36]:
cursor.execute(
'SELECT actors.actor, movies.movie \
FROM movies \
INNER JOIN movies_actors ON movies.id == movies_actors.movie_id \
INNER JOIN actors ON movies_actors.actor_id==actors.id \
WHERE actors.actor == "Natalie Portman" ;')

In [37]:
cursor.fetchall()

[('Natalie Portman', 'Black Swan'), ('Natalie Portman', 'Closer')]

# CSV vers SQLite

## Importer le csv en détectant son encodage

In [38]:
import pandas as pd
import chardet

In [39]:
chardet.detect(open('academy_awards.csv','rb').read())['encoding']

'ISO-8859-1'

In [40]:
df = pd.read_csv('academy_awards.csv', encoding=chardet.detect(open('academy_awards.csv','rb').read())['encoding'])

In [41]:
df.dtypes

Year               object
Category           object
Nominee            object
Additional Info    object
Won?               object
Unnamed: 5         object
Unnamed: 6         object
Unnamed: 7         object
Unnamed: 8         object
Unnamed: 9         object
Unnamed: 10        object
dtype: object

## Supprimer colonnes avec trop de valeurs manquantes

In [42]:
df.columns

Index(['Year', 'Category', 'Nominee', 'Additional Info', 'Won?', 'Unnamed: 5',
       'Unnamed: 6', 'Unnamed: 7', 'Unnamed: 8', 'Unnamed: 9', 'Unnamed: 10'],
      dtype='object')

In [43]:
df.isnull().sum().sort_values(ascending=False)/len(df)

Unnamed: 10        0.999901
Unnamed: 9         0.999901
Unnamed: 8         0.999803
Unnamed: 7         0.999704
Unnamed: 5         0.998915
Unnamed: 6         0.998816
Additional Info    0.111078
Won?               0.000000
Nominee            0.000000
Category           0.000000
Year               0.000000
dtype: float64

In [44]:
df = df[['Year','Category','Nominee','Won?', 'Additional Info']]
df.head()

,Year,Category,Nominee,Won?,Additional Info
0,2010 (83rd),Actor -- Leading Role,Javier Bardem,NO,Biutiful {'Uxbal'}
1,2010 (83rd),Actor -- Leading Role,Jeff Bridges,NO,True Grit {'Rooster Cogburn'}
2,2010 (83rd),Actor -- Leading Role,Jesse Eisenberg,NO,The Social Network {'Mark Zuckerberg'}
3,2010 (83rd),Actor -- Leading Role,Colin Firth,YES,The King's Speech {'King George VI'}
4,2010 (83rd),Actor -- Leading Role,James Franco,NO,127 Hours {'Aron Ralston'}

## Retravailler les colonnes

In [45]:
# Garder uniquement l'année
df['Year'].head()

0    2010 (83rd)
1    2010 (83rd)
2    2010 (83rd)
3    2010 (83rd)
4    2010 (83rd)
Name: Year, dtype: object

In [46]:
df['Year']= df['Year'].str[0:4].astype(int)

In [47]:
# Supprimer les films avant 2000
df = df[df['Year']>2000]

In [48]:
# Garder uniquement certaines catégories
df.Category.value_counts()

Writing                                                        100
Scientific and Technical (Technical Achievement Award)          70
Best Picture                                                    60
Short Film (Live Action)                                        50
Actor -- Supporting Role                                        50
Foreign Language Film                                           50
Film Editing                                                    50
Documentary (Feature)                                           50
Short Film (Animated)                                           50
Music (Scoring)                                                 50
Actress -- Leading Role                                         50
Art Direction                                                   50
Cinematography                                                  50
Actor -- Leading Role                                           50
Directing                                                       50
Sound                                                           50
Actress -- Supporting Role                                      50
Costume Design                                                  50
Scientific and Technical (Scientific and Engineering Award)     46
Music (Song)                                                    45
Documentary (Short Subject)                                     41
Sound Editing                                                   39
Animated Feature Film                                           34
Visual Effects                                                  32
Makeup                                                          29
Honorary Award                                                  14
Scientific and Technical (Bonner Medal)                          9
Scientific and Technical (Gordon E. Sawyer Award)                7
Scientific and Technical (Academy Award of Merit)                7
Scientific and Technical (Special Awards)                        5
Jean Hersholt Humanitarian Award                                 4
Irving G. Thalberg Memorial Award                                2
Name: Category, dtype: int64

In [49]:
award_category = ['Actor -- Supporting Role','Actress -- Supporting Role','Actor -- Leading Role','Actress -- Leading Role']

In [50]:
df = df[df.Category.isin(award_category)]
df.head(3)

,Year,Category,Nominee,Won?,Additional Info
0,2010,Actor -- Leading Role,Javier Bardem,NO,Biutiful {'Uxbal'}
1,2010,Actor -- Leading Role,Jeff Bridges,NO,True Grit {'Rooster Cogburn'}
2,2010,Actor -- Leading Role,Jesse Eisenberg,NO,The Social Network {'Mark Zuckerberg'}

In [51]:
# Mapper Won? Yes/No avec 1/0
df['Won?']= df['Won?'].map({"NO":0,"YES":1}).copy()

In [52]:
df.rename(columns={'Won?': 'Won'}, inplace=True)

In [53]:
df.head(3)

,Year,Category,Nominee,Won,Additional Info
0,2010,Actor -- Leading Role,Javier Bardem,0,Biutiful {'Uxbal'}
1,2010,Actor -- Leading Role,Jeff Bridges,0,True Grit {'Rooster Cogburn'}
2,2010,Actor -- Leading Role,Jesse Eisenberg,0,The Social Network {'Mark Zuckerberg'}

In [54]:
# Split Additional Info entre le titre et le perso principal
Additional_info_df = df['Additional Info'].str.split(" {'",expand=True)

In [55]:
df['Movie_name'], df['Character'] = Additional_info_df[0].str.strip(), Additional_info_df[1].str.replace("'}","").str.strip()

In [56]:
df.drop(columns='Additional Info', inplace=True)

In [57]:
df.head()

,Year,Category,Nominee,Won,Movie_name,Character
0,2010,Actor -- Leading Role,Javier Bardem,0,Biutiful,Uxbal
1,2010,Actor -- Leading Role,Jeff Bridges,0,True Grit,Rooster Cogburn
2,2010,Actor -- Leading Role,Jesse Eisenberg,0,The Social Network,Mark Zuckerberg
3,2010,Actor -- Leading Role,Colin Firth,1,The King's Speech,King George VI
4,2010,Actor -- Leading Role,James Franco,0,127 Hours,Aron Ralston

In [58]:
df.dtypes

Year           int64
Category      object
Nominee       object
Won            int64
Movie_name    object
Character     object
dtype: object

## Export vers SQLite

In [59]:
# Créer une nouvelle base de données - se connecter à une base inexistante la crée et initie la connexion
connexion3 = sqlite3.connect('nominations.db')

In [60]:
df.to_sql('nominations', connexion3, index=False, if_exists='replace')

In [63]:
connexion3.execute('PRAGMA table_info(nominations)').fetchall()

[(0, 'Year', 'INTEGER', 0, None, 0),
 (1, 'Category', 'TEXT', 0, None, 0),
 (2, 'Nominee', 'TEXT', 0, None, 0),
 (3, 'Won', 'INTEGER', 0, None, 0),
 (4, 'Movie_name', 'TEXT', 0, None, 0),
 (5, 'Character', 'TEXT', 0, None, 0)]

## Créer table ceremonies

Initier la table

In [66]:
connexion3.execute('CREATE TABLE ceremonies(\
id integer PRIMARY KEY,\
Year integer,\
Host text);').fetchall()

[]

In [67]:
connexion3.execute('PRAGMA table_info(ceremonies)').fetchall()

[(0, 'id', 'integer', 0, None, 1),
 (1, 'Year', 'integer', 0, None, 0),
 (2, 'Host', 'text', 0, None, 0)]

Remplir la table

In [69]:
# executemany
query='INSERT INTO ceremonies (Year, Host) VALUES (?,?);'
years_host = [(2010, "Steve Martin"),
(2009, "Hugh Jackman"),
(2008, "Jon Stewart"),
(2007, "Ellen DeGeneres"),
(2006, "Jon Stewart"),
(2005, "Chris Rock"),
(2004, "Billy Crystal"),
(2003, "Whoopi Goldberg"),
(2001, "Steve Martin"),
(2000, "Billy Crystal")]

In [70]:
connexion3.executemany(query, years_host)

In [71]:
connexion3.commit()

## Ajout clé externe

In [72]:
connexion3.execute('PRAGMA foreign_key = ON')

Comme on ne peut pas supprimer la colonne d'une table en sqlite, on en crée une nouvelle version "nominations2"

In [80]:
connexion3.execute('CREATE TABLE nominations2(\
id integer PRIMARY KEY,\
category text,\
nominee text,\
movie text,\
character text,\
won integer,\
year integer,\
ceremony_id integer REFERENCES ceremonies(id));').fetchall()

[]

In [82]:
connexion3.execute('PRAGMA table_info(nominations2)').fetchall()

[(0, 'id', 'integer', 0, None, 1),
 (1, 'category', 'text', 0, None, 0),
 (2, 'nominee', 'text', 0, None, 0),
 (3, 'movie', 'text', 0, None, 0),
 (4, 'character', 'text', 0, None, 0),
 (5, 'won', 'integer', 0, None, 0),
 (6, 'year', 'integer', 0, None, 0),
 (7, 'ceremony_id', 'integer', 0, None, 0)]

In [81]:
#connexion3.execute('DROP TABLE nominations_two;')

In [102]:
nominations='SELECT nominations.Category, nominations.Nominee, nominations.Movie_name, nominations.Character, nominations.Won, nominations.Year,ceremonies.id \
FROM nominations \
INNER JOIN ceremonies ON nominations.year == ceremonies.Year;'

In [104]:
nominations_values = connexion3.execute(nominations).fetchall()

In [105]:
insert_query = 'INSERT INTO nominations2 (category, nominee, movie, character, won, year, ceremony_id) VALUES (?,?,?,?,?,?,?)'

In [106]:
connexion3.executemany(insert_query, nominations_values)

In [107]:
connexion3.commit()

In [108]:
#connexion3.execute('DROP TABLE nominations;')

In [109]:
# Renommer table
connexion3.execute('ALTER TABLE nominations2 RENAME TO nominations;').fetchall()

[]

## Créer une join table

In [113]:
movies_query = 'CREATE TABLE movies( \
id integer PRIMARY KEY,\
movie text);'

actors_query = 'CREATE TABLE actors( \
id integer PRIMARY KEY,\
actor text);'

join_table_query = 'CREATE TABLE movies_actors(\
id integer PRIMARY KEY,\
movie_id INTEGER REFERENCES movies(id),\
actor_id integer REFERENCES actors(id))'

In [115]:
connexion3.execute(movies_query)
connexion3.execute(actors_query)
connexion3.execute(join_table_query)

In [117]:
connexion3.execute('PRAGMA foreign_key_list(movies_actors)').fetchall()

[(0, 0, 'actors', 'actor_id', 'id', 'NO ACTION', 'NO ACTION', 'NONE'),
 (1, 0, 'movies', 'movie_id', 'id', 'NO ACTION', 'NO ACTION', 'NONE')]